Revit 2026 API

# Transform2DBasisV Property

---

The image of (0, 1) under OfVector(UV).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV BasisV { get; set; }
```
```vb
Public Property BasisV As UV
	Get
	Set
```
```cpp
public:
property UV^ BasisV {
	UV^ get ();
	void set (UV^ value);
}
```
```fsharp
member BasisV : UV with get, set
```

#### Property Value

UV

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace